{
  "appetizers": [
    {
      "name": "Beef Haleem",
      "desc": "Haleem is made of four different kinds of lentils with cube beef and chef special spices.",
      "price": 9.99,
      "image": "images/beef-haleem.jpg",
      "videoId": "example-haleem-id"
    },
    {
      "name": "Shami Kabab",
      "desc": "Minced meat mixed with ground chickpeas, ginger & garlic and special spices then deep fried.",
      "price": 6.99,
      "image": "images/shami-kabab.jpg",
      "videoId": ""
    },
    {
      "name": "Chotpoti",
      "desc": "A tangy Bengali street food delight featuring tender chickpeas in a spicy, tamarind-infused sauce, topped with crunchy fuchka shells, onions, and fresh coriander.",
      "price": 9.99,
      "image": "images/chotpoti.jpg",
      "videoId": "KMqHbpsQmyE"
    },
    {
      "name": "French Fries",
      "desc": "Crispy golden strips of deliciousness served hot and seasoned to perfection.",
      "price": 4.99,
      "image": "images/french-fries.jpg",
      "videoId": ""
    },
    {
      "name": "Fuska 10 pc",
      "desc": "Crispy hollow puris filled with spiced potatoes, chickpeas, and tangy tamarind water. Each bite delivers an explosion of flavors and textures. Topped with fresh herbs and chutneys. A beloved Bengali street food snack that's refreshing and addictive.",
      "price": 11.99,
      "image": "images/fuska.jpg",
      "videoId": ""
    },
    {
      "name": "Shahi Mughlai",
      "desc": "A rich, royal-style slow-cooked stew of tender shredded beef and lentils, delicately spiced with aromatic herbs and finished with ghee, fried onions, and fresh herbs. This hearty Mughlai comfort dish offers a luxuriously smooth texture and deeply satisfying flavors.",
      "price": 0.0,
      "image": "images/shahi-mughlai.jpg",
      "videoId": ""
    },
    {
      "name": "Vegetable Samosa",
      "desc": "Crispy triangular pastries filled with spiced potatoes, peas, and vegetables. The golden, flaky exterior gives way to savory, aromatic filling. Served with chutneys for dipping. A classic Bengali snack favorite.",
      "price": 4.99,
      "image": "images/vegetable-samosa.jpg",
      "videoId": ""
    },
    {
      "name": "Chicken Shingara 2 pc",
      "desc": "Crispy, golden Bengali pastry with a savory spiced chicken filling, served with tangy tamarind chutney.",
      "price": 6.99,
      "image": "images/chicken-shingara.jpg",
      "videoId": "FOQRJRJ18lo"
    },
    {
      "name": "Morog Pulao",
      "desc": "Fragrant basmati rice slow-cooked with tender pieces of mutton in aromatic spices including cardamom, cinnamon, and bay leaves. Each grain is infused with rich flavors from caramelized onions, fresh mint, and saffron. Garnished with fried onions, and fresh cilantro.",
      "price": 19.99,
      "image": "images/morog-pulao.jpg",
      "videoId": ""
    },
    {
      "name": "Beef Tehari",
      "desc": "A rustic one-pot delicacy featuring tender beef chunks cooked with semi-boiled basmati rice in a rich, spiced gravy. Slow-simmered with aromatic whole spices, onions, and fresh herbs until the meat falls apart and the rice absorbs all the flavorful juices.",
      "price": 19.99,
      "image": "images/beef-tehari.jpg",
      "videoId": ""
    }
  ],
  "desserts": [
    {
      "name": "Ask for Daily Creation",
      "desc": "Ask about our daily dessert creation.",
      "price": 0.0,
      "image": "images/daily-dessert.jpg",
      "videoId": ""
    }
  ],
  "beverages": [
    {
      "name": "Malai Tea",
      "desc": "Rich and creamy spiced tea simmered with whole milk and topped with a layer of thick, velvety malai (milk cream). This indulgent chai offers a luxurious twist on traditional tea with its smooth, decadent texture and warming spices.",
      "price": 3.99,
      "image": "images/malai-tea.jpg",
      "videoId": ""
    },
    {
      "name": "Soda",
      "desc": "Carbonated refreshment.",
      "price": 1.99,
      "image": "images/soda.jpg",
      "videoId": ""
    },
    {
      "name": "Bottled Water",
      "desc": "Chilled bottled water.",
      "price": 1.79,
      "image": "images/bottled-water.jpg",
      "videoId": ""
    },
    {
      "name": "Borhani",
      "desc": "Bengali spiced yogurt drink blended with cumin, black salt, mint, and green chilies. This refreshing, savory beverage is tangy, mildly spiced, and perfect for cooling the palate. Served chilled with mint garnish. An authentic Bengali classic.",
      "price": 4.99,
      "image": "images/borhani.jpg",
      "videoId": ""
    },
    {
      "name": "Mango Shake",
      "desc": "Creamy blend of ripe mangoes with chilled milk, creating a smooth, refreshing tropical treat. Rich mango flavor and velvety texture in every sip. Served chilled with fresh mango garnish. A cooling, satisfying classic.",
      "price": 4.99,
      "image": "images/mango-shake.jpg",
      "videoId": ""
    },
    {
      "name": "Virgin Mojito",
      "desc": "Non-alcoholic mojito with fresh mint, lime juice, and simple syrup, topped with soda water. All the refreshing, invigorating flavors of the classic without the alcohol. Served over ice with mint garnish. A perfect family-friendly refresher.",
      "price": 6.99,
      "image": "images/virgin-mojito.jpg",
      "videoId": ""
    },
    {
      "name": "Ocean Blue Mojito",
      "desc": "Classic mojito enhanced with blue curaçao for a stunning ocean-blue color. White rum muddled with fresh mint, lime, and simple syrup, topped with soda water. The beautiful blue hue and refreshing flavors create a tropical paradise experience. Served over ice with mint garnish.",
      "price": 6.99,
      "image": "images/ocean-blue-mojito.jpg",
      "videoId": ""
    },
    {
      "name": "Evergreen Mojito",
      "desc": "Classic mojito enhanced with fresh herbs for a vibrant green color and botanical complexity. White rum muddled with mint, lime, herbs, and simple syrup, topped with soda water. The fresh, garden-like flavors create an invigorating experience. Served over ice with herb garnish.",
      "price": 6.99,
      "image": "images/evergreen-mojito.jpg",
      "videoId": ""
    }
  ],
  "bhorta": [
    {
      "name": "Shutky Bhorta",
      "desc": "Bengali-style mashed dried fish mixed with cilantro, onions, green chilies, and mustard oil. This rustic, flavorful dish delivers authentic umami-rich taste. A traditional Bengali comfort food with bold, distinctive flavors.",
      "price": 6.99,
      "image": "images/shutky-bhorta.jpg",
      "videoId": ""
    },
    {
      "name": "Aloo Bhorta",
      "desc": "Bengali-style mashed potatoes mixed with mustard oil, onions, green chilies, and fresh cilantro. This rustic, home-style dish delivers authentic Bengali comfort food flavors. Served with steamed rice. A simple yet deeply satisfying traditional favorite.",
      "price": 6.99,
      "image": "images/aloo-bhorta.jpg",
      "videoId": ""
    },
    {
      "name": "Daal Bhortha",
      "desc": "Bengali-style mashed lentils mixed with mustard oil, onions, green chilies, and fresh cilantro. This rustic, home-style dish transforms simple dal into a flavorful comfort food. Served with steamed rice. A protein-rich Bengali favorite.",
      "price": 6.99,
      "image": "images/daal-bhorta.jpg",
      "videoId": ""
    },
    {
      "name": "Shrimp Bhortha",
      "desc": "Bengali-style mashed shrimp mixed with mustard oil, onions, green chilies, and fresh cilantro. This rustic, home-style dish combines sweet shrimp with bold Bengali flavors. Served with steamed rice. A coastal Bengali comfort food favorite.",
      "price": 6.99,
      "image": "images/shrimp-bhorta.jpg",
      "videoId": ""
    }
  ],
  "dailyMenu": [
    {
      "name": "Chicken Kosha",
      "desc": "Tender chicken marinated in yogurt, blended with spices of cumin and coriander and enriched with coconut milk into a savory and mild gravy. The creamy, aromatic sauce perfectly complements the succulent meat while delivering gentle, warming flavors. Served with steamed basmati rice or warm naan bread. A comforting, mildly spiced curry that's rich and satisfying.",
      "price": 16.99,
      "image": "images/chicken-kosha.jpg",
      "videoId": ""
    },
    {
      "name": "Parata",
      "desc": "Flaky, layered Indian flatbread cooked with ghee until golden and crispy outside, soft inside. The buttery, multi-layered bread is perfect with curries or enjoyed on its own. Served hot from the griddle. A classic, versatile Indian bread.",
      "price": 3.2,
      "image": "images/parata.jpg",
      "videoId": ""
    },
    {
      "name": "Beef Bhuna",
      "desc": "Tender beef chunks slow-cooked in aromatic spices using the authentic bhuna method until coated in a rich, thick gravy. The meat becomes incredibly tender while absorbing deep, concentrated flavors. Served with rice or naan. A hearty, traditional favorite.",
      "price": 18.99,
      "image": "images/beef-bhuna.jpg",
      "videoId": ""
    },
    {
      "name": "Daal",
      "desc": "Slow-cooked lentil curry with aromatic spices, onions, and tomatoes until creamy and flavorful. Tempered with mustard seeds and curry leaves. Served with rice or bread. A nourishing, protein-rich Indian staple.",
      "price": 3.99,
      "image": "images/daal.jpg",
      "videoId": ""
    },
    {
      "name": "Korola Bhaji",
      "desc": "Bengali-style bitter gourd stir-fry cooked with onions, spices, and mustard oil until tender. The unique, earthy flavors are balanced with aromatic spices. Served with rice. A healthy, traditional Bengali vegetable dish.",
      "price": 8.99,
      "image": "images/korola-bhaji.jpg",
      "videoId": ""
    },
    {
      "name": "Roast",
      "desc": "Slow-roasted meat seasoned with herbs and spices until golden and tender. Served with roasted vegetables, mashed potatoes, and rich gravy. A hearty, comforting dish perfect for sharing.",
      "price": 7.99,
      "image": "images/roast.jpg",
      "videoId": ""
    },
    {
      "name": "Kochor Loti",
      "desc": "Bengali taro stem curry cooked with aromatic spices, onions, and mustard oil until tender. This unique vegetable delivers mild, earthy flavors and distinctive texture. Served with rice. A seasonal Bengali specialty.",
      "price": 10.99,
      "image": "images/kochor-loti.jpg",
      "videoId": ""
    },
    {
      "name": "Beef Curry with Naan or Rice",
      "desc": "Tender beef chunks slow-cooked in aromatic spices, onions, and tomatoes until fork-tender. The rich, flavorful gravy is perfectly spiced and satisfying. Served with your choice of rice or naan. A classic, hearty curry dish.",
      "price": 20.99,
      "image": "images/beef-curry.jpg",
      "videoId": ""
    },
    {
      "name": "Butter Naan",
      "desc": "Soft, pillowy flatbread baked in our tandoor oven and brushed with melted butter. The tender, slightly charred bread is perfect for scooping up curries. Served warm and fresh. A classic Indian bread favorite.",
      "price": 3.2,
      "image": "images/butter-naan.jpg",
      "videoId": ""
    },
    {
      "name": "Garlic Naan",
      "desc": "Soft, pillowy flatbread baked in our tandoor oven and topped with minced garlic, cilantro, and melted butter. The aromatic garlic becomes fragrant and golden during baking. Served warm and fresh. A flavorful twist on classic naan.",
      "price": 4.99,
      "image": "images/garlic-naan.jpg",
      "videoId": ""
    }
  ],
  "kebabs": [
    {
      "name": "Chicken Malai Kabab",
      "desc": "Succulent pieces of chicken marinated in cream, yogurt, and mild spices, then grilled or cooked to perfection. This creamy, aromatic dish features tender meat with a rich, velvety sauce that's delicately flavored and beautifully mild, making it a perfect choice for those who prefer gentler spices.",
      "price": 18.99,
      "image": "images/chicken-malai-kabab.jpg",
      "videoId": ""
    },
    {
      "name": "Chicken Tandoori Platter",
      "desc": "Tender chicken marinated in yogurt and aromatic spices, then roasted in a traditional clay oven until smoky and charred. This classic dish features juicy meat with a vibrant red color and bold flavors of cumin, coriander, and garam masala, served sizzling hot with a distinctive smoky taste.",
      "price": 18.99,
      "image": "images/chicken-tandoori.jpg",
      "videoId": ""
    },
    {
      "name": "Chicken Shish Kabab Platter",
      "desc": "Juicy cubes of marinated chicken threaded on skewers and grilled to perfection. Tender pieces are infused with aromatic spices and herbs, then charcoal-grilled for a smoky flavor and beautifully caramelized exterior while remaining succulent inside.",
      "price": 18.99,
      "image": "images/chicken-shish-kabab.jpg",
      "videoId": ""
    },
    {
      "name": "Chicken Tikka Masala w/ Naan",
      "desc": "Tender pieces of char-grilled chicken tikka simmered in a rich, creamy tomato-based sauce with aromatic spices and a hint of sweetness. Served alongside freshly baked naan bread, perfect for scooping up every bit of this beloved curry's velvety, flavorful sauce.",
      "price": 18.99,
      "image": "images/chicken-tikka-masala.jpg",
      "videoId": ""
    },
    {
      "name": "Dhansiri Special Platter w/ Naan",
      "desc": "Our chef's special dish changes daily, featuring fresh seasonal ingredients and authentic Bengali flavors. From fish curries to meat specialties to seasonal vegetables - each day offers something new. Ask our counter staff about today's special. A daily culinary adventure.",
      "price": 25.99,
      "image": "images/dhansiri-special-platter.jpg",
      "videoId": ""
    },
    {
      "name": "Beef Bihari Kabab Platter",
      "desc": "Tender strips of beef marinated in yogurt, raw papaya, and traditional Bihari spices, then grilled to smoky perfection. This specialty from Bihar features melt-in-your-mouth meat with deep, earthy flavors and a distinctive char, served with onions and mint chutney.",
      "price": 24.99,
      "image": "images/beef-bihari-kabab.jpg",
      "videoId": ""
    },
    {
      "name": "Butter Chicken w/ Naan",
      "desc": "Tender pieces of marinated chicken in a luxuriously creamy tomato-based sauce enriched with butter and aromatic spices. This beloved Indian classic offers a perfect balance of mild heat and velvety smoothness, with hints of fenugreek and garam masala creating its signature rich, comforting flavor.",
      "price": 18.99,
      "image": "images/butter-chicken.jpg",
      "videoId": ""
    },
    {
      "name": "Chicken Chaap w/ Naan or Paratha",
      "desc": "Succulent chicken pieces slow-cooked in a rich, creamy curry with aromatic whole spices, yogurt, and fried onions. This Mughlai-style dish features tender meat in a luxurious, mildly spiced gravy with hints of cardamom and bay leaves, creating an elegant and flavorful experience.",
      "price": 18.99,
      "image": "images/chicken-chaap.jpg",
      "videoId": ""
    },
    {
      "name": "Goat Kacchi",
      "desc": "Tender goat meat and basmati rice cooked together using the authentic kacchi method until the meat is fall-apart tender. Infused with saffron, mint, and aromatic spices. Served with raita and accompaniments. A royal biryani specialty.",
      "price": 23.99,
      "image": "images/goat-kacchi.jpg",
      "videoId": ""
    },
    {
      "name": "Khichuri",
      "desc": "Bengali comfort food featuring rice and lentils slow-cooked together with aromatic spices until creamy and porridge-like. This wholesome one-pot dish combines basmati rice with yellow moong dal, turmeric, ginger, and whole spices, creating a nourishing meal that's both satisfying and easily digestible. Often enhanced with vegetables like cauliflower, peas, or potatoes for added nutrition and flavor. Tempered with ghee, cumin seeds, and bay leaves for authentic taste.",
      "price": 9.99,
      "image": "images/khichuri.jpg",
      "videoId": ""
    },
    {
      "name": "Polao",
      "desc": "Fragrant basmati rice cooked with whole spices, saffron, and caramelized onions until fluffy and perfectly spiced.",
      "price": 9.99,
      "image": "images/polao.jpg",
      "videoId": ""
    },
    {
      "name": "Rice",
      "desc": "Premium long-grain rice steamed until fluffy and aromatic. The perfect accompaniment to curries and spiced dishes.",
      "price": 2.99,
      "image": "images/rice.jpg",
      "videoId": ""
    },
    {
      "name": "Beef Kacchi",
      "desc": "Tender beef and basmati rice cooked together using the authentic kacchi method until the meat is fork-tender. Infused with saffron, mint, and aromatic spices. Served with raita and accompaniments. A royal biryani specialty.",
      "price": 19.99,
      "image": "images/beef-kacchi.jpg",
      "videoId": ""
    },
    {
      "name": "Beef Tehari",
      "desc": "A rustic one-pot delicacy featuring tender beef chunks cooked with semi-boiled basmati rice in a rich, spiced gravy. Slow-simmered with aromatic whole spices, onions, and fresh herbs until the meat falls apart and the rice absorbs all the flavorful juices.",
      "price": 19.99,
      "image": "images/beef-tehari.jpg",
      "videoId": ""
    },
    {
      "name": "Chicken Tehari",
      "desc": "Succulent chicken and basmati rice cooked together in a spiced, gravy-rich preparation. Unlike biryani, the rice and meat meld together in perfect harmony, creating a comforting one-pot meal.",
      "price": 19.99,
      "image": "images/chicken-tehari.jpg",
      "videoId": ""
    }
  ],
  "fish": [
    {
      "name": "Shrimp Bhuna",
      "desc": "Fresh shrimp cooked in aromatic spices using the authentic bhuna method until coated in a rich, thick gravy. The sweet shrimp absorb deep, concentrated flavors perfectly. Served with rice or bread. A flavorful seafood specialty.",
      "price": 19.99,
      "image": "images/shrimp-bhuna.jpg",
      "videoId": ""
    },
    {
      "name": "Pangash Fish Jhol (2 pc)",
      "desc": "Fresh pangash fish cooked in a light, spiced curry with onions, tomatoes, and traditional Bengali spices. The mild fish is simmered in thin, flavorful broth.",
      "price": 19.99,
      "image": "images/pangash-fish-jhol.jpg",
      "videoId": ""
    },
    {
      "name": "Ruhi Fish Jhol (2 pc)",
      "desc": "Fresh rohu fish cooked in a light, aromatic Bengali curry with onions, tomatoes, and traditional spices. The meaty ruhi pieces are gently simmered in a thin, flavorful broth seasoned with turmeric, cumin, ginger, and green chilies, creating a comforting, home-style jhol (thin curry). The firm, sweet flavor of rohu absorbs the spiced gravy beautifully while maintaining its substantial texture. Enhanced with fresh cilantro and a touch of mustard oil for authentic Bengali taste.",
      "price": 17.99,
      "image": "images/ruhi-fish-jhol.jpg",
      "videoId": ""
    },
    {
      "name": "Ilish Fish",
      "desc": "Premium Bengali hilsa fish, prized for its delicate texture and rich, distinctive flavor. This seasonal delicacy is prepared with traditional spices and cooking methods, offering an authentic taste of Bengal's most beloved fish. Available fresh during hilsa season.",
      "price": 13.99,
      "image": "images/ilish-fish.jpg",
      "videoId": ""
    }
  ],
  "lunchMenu": [
    {
      "name": "Chicken Tikka Naan Wrap",
      "desc": "Smoky chicken tikka wrapped in warm naan with fresh vegetables, mint chutney, and yogurt sauce. The perfect fusion of traditional tandoori flavors in a convenient handheld format. Served with fries or salad. A satisfying, flavorful wrap.",
      "price": 14.99,
      "image": "images/chicken-tikka-naan-wrap.jpg",
      "videoId": ""
    },
    {
      "name": "Chicken Tikka Paratha Roll",
      "desc": "Smoky chicken tikka wrapped in buttery, flaky paratha with fresh vegetables, mint chutney, and yogurt sauce. The rich, layered bread perfectly complements the spiced chicken. Served with fries or salad. A satisfying, indulgent wrap.",
      "price": 12.99,
      "image": "images/chicken-tikka-paratha-roll.jpg",
      "videoId": ""
    },
    {
      "name": "Chicken Malai Naan Wrap",
      "desc": "Tender chicken malai wrapped in warm naan with fresh vegetables, mint chutney, and yogurt sauce. The creamy, mildly spiced chicken offers rich, delicate flavors. Served with fries or salad. A luxurious, gentle-spiced wrap.",
      "price": 12.99,
      "image": "images/chicken-malai-naan-wrap.jpg",
      "videoId": ""
    },
    {
      "name": "Chicken Malai Paratha Roll",
      "desc": "Tender chicken malai wrapped in buttery, flaky paratha with fresh vegetables, mint chutney, and yogurt sauce. The creamy, mild chicken perfectly complements the rich, layered bread. Served with fries or salad. A luxurious, indulgent wrap.",
      "price": 13.99,
      "image": "images/chicken-malai-paratha-roll.jpg",
      "videoId": ""
    },
    {
      "name": "Chicken Shish Kebab Roll",
      "desc": "Marinated chicken chunks grilled with peppers and onions, wrapped in soft bread with fresh vegetables and chutneys. The smoky, tender kabab delivers bold flavors with every bite. Served with fries or salad. A satisfying, authentic kabab roll.",
      "price": 14.99,
      "image": "images/chicken-shish-kabab-roll.jpg",
      "videoId": ""
    },
    {
      "name": "Chicken Shish Kebab Wrap",
      "desc": "Marinated chicken chunks grilled with peppers and onions, wrapped in a soft tortilla with fresh vegetables and chutneys. The smoky, tender kabab delivers bold flavors with every bite. Served with fries or salad. A modern, flavorful kabab wrap.",
      "price": 13.99,
      "image": "images/chicken-shish-kabab-wrap.jpg",
      "videoId": ""
    },
    {
      "name": "Chicken Shami Kabab Roll",
      "desc": "Soft, spiced chicken shami kababs wrapped in flatbread with fresh vegetables and chutneys. The delicate, melt-in-your-mouth kababs offer rich, complex flavors and smooth texture. Served with fries or salad. An elegant, traditional kabab roll.",
      "price": 14.99,
      "image": "images/chicken-shami-kabab-roll.jpg",
      "videoId": ""
    },
    {
      "name": "Beef Kabab Roll",
      "desc": "Seasoned ground beef kababs grilled until juicy and wrapped in soft bread with fresh vegetables and chutneys. The richly spiced, tender kababs deliver bold, savory flavors. Served with fries or salad. A hearty, protein-rich roll.",
      "price": 14.99,
      "image": "images/beef-kabab-roll.jpg",
      "videoId": ""
    },
    {
      "name": "Beef Kabab Wrap",
      "desc": "Seasoned ground beef kababs grilled until juicy and wrapped in a soft tortilla with fresh vegetables and chutneys. The richly spiced, tender kababs deliver bold, savory flavors. Served with fries or salad. A modern, hearty kabab wrap.",
      "price": 14.99,
      "image": "images/beef-kabab-wrap.jpg",
      "videoId": ""
    }
  ]
}